package dev.weekend.slashcommand.domain.constant

/**
 * @author Yoohwa Cho
 */
object LunchConstant {
    val CONFIRM_LIST = listOf(
        "🍽️ 점심 식당이 최종 결정됐어요! 🎉",
        "🏡 오늘의 점심 장소가 확정됐습니다! 🍛✨",
        "🍜 점심 식당 선정 완료! 맛있게 먹어요~ 😋",
        "🍕 점심 먹을 곳이 정해졌어요! 다 같이 고고~ 🚀",
        "🍱 점심 장소가 드디어 결정! 기대되네요! 💫",
        "🍔 오늘의 맛집 확정! 배고픈 사람 손 ✋😆",
        "🥗 점심 식당 공식 선택 완료! 🔥",
        "🌮 점심 먹으러 갈 곳 확정! 얼른 가요~ 🏃💨",
        "🍣 점심 장소 최종 확정! 배고픔 해결! 🔥😋",
        "🍩 점심 식당 드디어 결정! 행복한 점심 되세요~ ☀️💛",
        "🍽️ 오늘의 점심 식당이 결정되었답니다, 꼬옥 맛있게 드세요! 😊🌿",
        "🍛 점심 장소가 정해졌어요, 천천히 가서 함께 즐겨볼까요? 🌼✨",
        "🍜 오늘은 이곳에서 식사하기로 했답니다, 기대되는걸요! 😋💛",
        "🍕 점심 먹을 곳이 확정되었어요, 따뜻한 한 끼가 될 거예요! 🍃💕",
        "🍔 점심 장소를 결정했답니다, 배고프지 않게 서둘러 가요! 🐾🌸",
        "🍩 점심 식당이 선정되었답니다, 마음도 배도 든든해질 거예요! 🍀🍽️",
        "🌮 점심 장소가 확정되었어요, 천천히 걸으며 가도 좋겠어요! 🚶‍🎵",
        "🍱 오늘의 식사 장소는 여기랍니다, 맛있는 시간이 되길 바라요! 💫🐰",
        "🥞 점심 먹을 곳이 정해졌어요, 행복한 한 끼 되세요! ☕🍃",
    )
    val KOREAN_EMOJIS = listOf("🍚", "🍖", "🥘", "🍲")
    val CHINESE_EMOJIS = listOf("🥡", "🥠", "🥟")
    val JAPANESE_EMOJIS = listOf("🍱", "🍛", "🍜", "🍣", "🍤", "🍥")
    val SNACK_EMOJIS = listOf("🥞", "🥙", "🥣")
    val CAFETERIA_EMOJIS = listOf("🍱")
    val FASTFOOD_EMOJIS = listOf("🍔", "🍟", "🌭")
    val SALAD_EMOJIS = listOf("🥞", "🥪", "🥙", "🥗", "🍩", "🍪", "🍰", "🥧")
    val ETC_EMOJIS = listOf("🍖", "🍕", "🌮", "🥘", "🍝")
    val BUFFET_EMOJIS = listOf("🥞", "🍖", "🍕", "🌮", "🥙", "🍝", "🍣", "🍤", "🥟")

    //다시 고르기
    val SAD_EMOJIS = listOf("🥹", "😅", "🥲", "😌", "😔", "😖", "😥", "😮", "😵")
    //선택 || 좋아요
    val HAPPY_EMOJIS = listOf("😀", "😃", "😄", "😁", "😆", "️😊", "🙂", "😋", "😝", "🥳", "🤩", "🤗", "😎")
    //처음으로
    val RESET_EMOJIS = listOf("🫠", "🥴", "😵‍💫", "🤠", "🤓", "🧐", "😶‍🌫", "🫨")
    //아직 안가봤어요
    val DONT_KNOW_EMOJIS = listOf("🧐", "🥸", "😳", "🤔", "😶", "🫨", "😬", "😮", "😵‍💫", "🤫")
    //별로였어요
    val DONT_LIKE_EMOJIS = listOf("🥹", "😅", "😂", "🥲", "😔", "😖", "😭", "😥", "😮", "😵", "😒", "😫", "😤", "😱", "🥵", "🤯")
}
